simulacoes/bump/rhoPimpleFoam/tranSonico/upwind/252x54/sim2/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type                 surfaces;
libs                 ("libsampling.so");
writeControl         runTime;
writeInterval        0.1;
writeFormat          ascii;

interpolationScheme  cellPoint;
surfaceFormat        vtk;

fields               (T mag(U) p Ma);

surfaces
(
    lowerWall
    {
        type         patch;
        patches      (lowerWall);
        //interpolate  true;
    }
    
    upperWall
    {
        type         patch;
        patches      (upperWall);
        //interpolate    true;
    }
);


// ************************************************************************* //
